print('Введи не равные нулю координаты X и Y через пробел')
x, y = map(int, input().split())
if x == 0 and y == 0:
    print('Ну это начало координат!')
elif x == 0:
    print(f'Точка с координатами [{x}, {y}] лежит на оси абсцисс.')
elif y == 0:
    print(f'Точка с координатами [{x}, {y}] лежит на оси ординат.')
elif x > 0:
    if y > 0:
        print(f'Точка с координатами [{x}, {y}] в первой четверти.')
    else:
        print(f'Точка с координатами [{x}, {y}] в четвёртой четверти.')
elif x < 0:
    if y > 0:
        print(f'Точка с координатами [{x}, {y}] во второй четверти.')
    else:
        print(f'Точка с координатами [{x}, {y}] в третьей четверти.')